fio_result/test_xvdp1_64/fio.randwrite.512.1.log
/dev/xvdp1: (g=0): rw=randwrite, bs=512-512/512-512/512-512, ioengine=libaio, iodepth=64
fio-2.0.13
Starting 1 process

/dev/xvdp1: (groupid=0, jobs=1): err= 0: pid=28763: Sun Jun 29 05:38:15 2014
  write: io=46665KB, bw=1554.2KB/s, iops=3108 , runt= 30026msec
    slat (usec): min=7 , max=130 , avg= 9.44, stdev= 2.13
    clat (usec): min=755 , max=52932 , avg=20571.96, stdev=6264.59
     lat (usec): min=766 , max=52940 , avg=20582.50, stdev=6264.57
    clat percentiles (usec):
     |  1.00th=[ 3472],  5.00th=[11840], 10.00th=[12864], 20.00th=[14912],
     | 30.00th=[16768], 40.00th=[18816], 50.00th=[20864], 60.00th=[22912],
     | 70.00th=[24960], 80.00th=[26752], 90.00th=[28800], 95.00th=[30080],
     | 99.00th=[32128], 99.50th=[33024], 99.90th=[35584], 99.95th=[37632],
     | 99.99th=[46336]
    bw (KB/s)  : min= 1449, max= 3010, per=99.98%, avg=1553.70, stdev=191.49
    lat (usec) : 1000=0.01%
    lat (msec) : 2=0.19%, 4=1.08%, 10=0.78%, 20=44.82%, 50=53.13%
    lat (msec) : 100=0.01%
  cpu          : usr=2.87%, sys=4.50%, ctx=67256, majf=0, minf=22
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=0/w=93330/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
  WRITE: io=46665KB, aggrb=1554KB/s, minb=1554KB/s, maxb=1554KB/s, mint=30026msec, maxt=30026msec

Disk stats (read/write):
  xvdp: ios=50/92835, merge=0/0, ticks=10/1909275, in_queue=1910041, util=99.58%